{
  "about": "عني",
  "description": "Ceci est une application React avec traduction.",
  "header": {
    "title": "مطور ويب شامل",
    "subtitle": "Ceci est la section d'en-tête"
  },
  "footer": {
    "text": "© 2023 Mon application. Tous droits réservés."
  },
  "sidebar": {
    "about_me": "عني",
    "services": "خدماتي",
    "projects": "مشاريعي",
    "skills": "مهاراتي",
    "contact": "تواصل معي",
    "copyright": "حقوق النشر © 2025 جميع الحقوق محفوظة",
    "designed": "تم التصميم من قبل نايا الناقولا"
  },
  "home_section": {
    "hello": "مرحبا أنا",
    "name": "نايا الناقولا",
    "job": "مطور ويب شامل",
    "description": "أنا مطور برامج متكامل ومبتكر، شغوف ببناء تطبيقات ويب ديناميكية وسريعة الاستجابة. بفضل خبرتي في تقنيات الواجهة الأمامية والخلفية، أسعى جاهدًا لتحويل الأفكار إلى حلول عملية وسهلة الاستخدام.",
    "download": "تحميل ال CV"
  },
  "services": {
    "title": "خدماتي",
    "description": "أقدم حلولاً مصممة خصيصًا لمساعدتك على تحقيق أهدافك. دعنا نجعل أفكارك حقيقة",
    "ui_ux": "UI/UX",
    "ui_ux_description": "إنشاء واجهات واضحة وسهلة الاستخدام من خلال البحث عن المستخدم، والنمذجة السلكية، والنماذج الأولية، والتصميم المرئي للحصول على تجربة سلسة. باستخدام <strong>Figma </strong>.",
    "front_end": "Front End",
    "front_end_description": "إنشاء تطبيقات ويب سريعة الاستجابة وتفاعلية باستخدام <strong> HTML </strong> و<strong> CSS </strong> و<strong> JavaScript </strong> و<strong> Bootstrap </strong> و <strong> React </strong> لضمان التوافق عبر الأجهزة والمتصفحات.",
    "back_end": "Back End",
    "back_end_description": "تطوير تطبيقات قابلة للتطوير على جانب الخادم، مع التركيز على إدارة قواعد البيانات وتطوير واجهة برمجة التطبيقات والتعامل الآمن مع البيانات باستخدام <strong> Laravel </strong>."
  },
  "projects": {
    "title": "مشاريعي",
    "description": "اكتشف بعضاً من أعمالي",
    "demo": "عرض",
    "details": "تفاصيل",
    "append": "Append Project",
    "golf": "Golf Project",
    "grand_coffy": "Grand Coffe Project",
    "flex_start": "Flex Start Project",
    "spotify": "Spotify Project",

    "append_description": "أعدتُ إنشاء قالب Append (الذي كان في الأصل من BootstrapMade) كمشروع تدريبي لإتقان تطوير واجهات المستخدم الأمامية الحديثة. صُمم هذا القالب المتجاوب للشركات الناشئة والتطبيقات والخدمات الرقمية، ويتميز بتصميمات أنيقة وأداء مُحسّن.",
    "golf_description": "قالب Bootstrap 5 أنيق وحديث، بُني من الصفر كمشروع تدريبي. يُركز على التصميم المتجاوب والأداء وسهولة التفاعل. يُظهر هذا قدرتي على تحويل تصميمات واجهة المستخدم إلى مواقع ويب عملية.",
    "grand_coffe_description": "  أعدتُ تصميم قالب Grand Coffe كمشروع تدريبي لإتقان تصميم مواقع الإنترنت الخاصة بقطاع الأغذية. هذا القالب المتجاوب مثالي للمقاهي، إذ يتميز بصور جذابة، وقوائم طعام مميزة، وخاصية الحجز.",
    "luxary_description": "لقد طورتُ قالب LuxuryHotel كمشروع تدريبي لإتقان تصميم مواقع الويب الخاصة بالضيافة الراقية. يُبرز هذا القالب المتجاوب الأناقة والعملية، ويضم معارض للغرف، وأنظمة حجز، وعروضًا مرئية غامرة.",
    "flexStart_description": "قمتُ بتحديث قالب Flex Start إلى موقع ويب تفاعلي مزود بوظائف CRUD، باستخدام React وJSON Server لمحاكاة سير عمل API الحقيقي. يُظهر هذا قدرتي على دمج واجهات المستخدم الأمامية مع منطق الواجهة الخلفية.",
    "spotify_description": "لوحة معلومات ديناميكية تتصل بواجهة برمجة تطبيقات Spotify لعرض عادات الاستماع للمستخدم. تعرض إحصاءات مخصصة، مثل أفضل الفنانين والأغاني والألبومات، عبر فترات زمنية متعددة، بالإضافة إلى عرض إحصاءات الفنان، مثل أفضل الأغاني، عبر فترات زمنية متعددة، باستخدام فلاتر تفاعلية.",
    "technologies": "التقنيات المستخدمة",
    "visit_site": "زيارة الموقع"
  },


  "skills": {
    "title": "مهاراتي",
    "problem_solving": "حل المشاكل",
    "effictive_communication": "التواصل الفعال",
    "ًwork_under_pressure": "العمل تحت الضغط"
  },
  "contact": {
    "title": "تواصل معي",
    "description": "منفتحون على فرص جديدة، أو تعاونات، أو حتى مجرد دردشة! تواصلوا معنا لطلب مشاريع، أو ملاحظات، أو حتى تحية بسيطة."
  }
}
